'''Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
Примеры
список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
список: [], ищем: "123", ответ: -1'''

list_text = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
search_str = "qwe"

search_result = list([(i, c) for i, c in enumerate(list_text) if c == search_str])
if len(search_result) > 1:
    print(search_result[1][0])
else:
    print(-1)
